# value-history REPL feature

## 如何测试？

正常编译
```sh
xmake f -v -y
xmake b goldfish
```

进入 REPL 尝试 value history
```sh
./bin/goldfish -i
...
gf> (+ 1 2 3)
$1 = 6
gf> (define ans 42)
$2 = 42
gf> (* $1 $2)
$3 = 252
gf> (list $1 $2 $3)
$4 = (6 42 252)
gf> ,d $3
$3 (integer?)
  Value: 252
gf> 7
$5 = 7
gf>
```

其中 `$n` 是自动 define 到 curlet 的 value。

## 2025/07/30

### What

新增 REPL value-history 特性

参考 Guile REPL: https://www.gnu.org/software/guile/manual/html_node/Value-History.html

#### 缺陷

history 大小无限制，在极少数的情况下会将内存耗尽。

### Why

方便 REPL 使用探索时自由引用 eval 过的值。
